import streamlit as st
from PIL import Image

def app():
    st.title('Cardiovascular Diseases')

    image1 = Image.open('./data/infoPic1.jpg')
    st.image(image1, caption='Cardiovascular Diseases (CVD)')

    st.markdown(""" &nbsp;&nbsp;&nbsp;&nbsp;&nbsp โรคหัวใจและหลอดเลือด (cardiovascular diseases) เป็นกลุ่มโรคที่เกิดกับระบบหัวใจและหลอดเลือด ซึ่งเป็นสาเหตุการเสียชีวิตลาดับต้นของคนไทย ในแต่ละปีจะมีคนไทยเสียชีวิตจากโรคนี้ถึง 54,530 ราย 
    และมีแนวโน้มเพิ่มสูงขึ้นทุกปี โดยสามในสี่ของการเสียชีวิตด้วยโรคหัวใจและหลอดเลือดทั้งหมดเกิดจากโรค หลอดเลือดสมอง (cerebrovascular diseases) และโรคหัวใจขาดเลือด (ischaemic heart diseases) 
    ซึ่งเกิดจากการที่หลอดเลือดตีบตันหรือขาดความยืดหยุ่น จากการสะสมของไขมัน โปรตีน และแร่ธาตุที่บริเวณ ผนังหลอดเลือด""")

    st.markdown(""" &nbsp;&nbsp;&nbsp;&nbsp;&nbsp ในปัจจุบันมีการตรวจคัดกรองสุขภาพโดยค้นหาปัจจัยเสี่ยงในการเกิดโรคดังกล่าวด้วยการประเมินความเสี่ยงโดยรวม (global risk score) ซึ่งเป็นการประเมินปัจจัยเสี่ยงหลายปัจจัยพร้อมๆกัน เพื่อทำนายโอกาสเกิดโรคภายในอนาคตข้างหน้า 
    โดยปัจจัยเสี่ยงที่สาคัญและมีหลักฐานทางวิชาการว่าสัมพันธ์กับการเกิดโรคหัวใจและหลอดเลือด สามารถแบ่งได้เป็น 2 ประเภท ประเภทแรกคือ ปัจจัยเสี่ยงที่ปรับเปลี่ยนไม่ได้ เช่น อายุ เพศ ประวัติครอบครัว และ เชื้อชาติ ประเภทที่สองเป็นปัจจัยเสี่ยงที่ปรับเปลี่ยนได้ เช่น 
    ความดันโลหิตสูง ระดับไขมันชนิดโคเลสเตอรอลรวมสูง ระดับไขมันชนิดเอชดีแอลต่า ระดับน้าตาลในเลือดสูง ภาวะอ้วนและ การสูบบุหรี่ อีกทั้งการเป็นโรคร่วม ได้แก่ โรคไตเรื้อรัง โรคหัวใจเต้นผิดจังหวะชนิด Atrial Fibrillation โรคข้อ อักเสบรูมาตอยด์ และภาวะหัวใจห้องล่างซ้ายโต 
    ก็เป็นปัจจัยเสี่ยงต่อการเกิดโรคหัวใจและหลอดเลือดได้เช่นกัน""")

    image2 = Image.open('./data/infoPic2.jpg')
    st.image(image2, caption="CVD The World's Number1 Killer")

    st.subheader("อาการของโรค")
    st.markdown("""
    เนื่องจากโรคหัวใจเป็นโรคที่กว้างมาก ความผิดปกติที่เกิดขึ้นอาจเกิดได้จากหลายส่วน และจะมีอาการที่แตกต่างกัน แต่อาการที่พบได้บ่อยและเป็นอาการเสี่ยงของโรคหัวใจมีดังนี้
    - เหนื่อยง่ายกว่าปกติ เช่น เวลาออกกำลังกาย หรือทำกิจกรรมที่ต้องใช้แรงเยอะจะรู้สึกหอบ หายใจเร็ว หายใจไม่ทัน บางรายอาจมีอาการหอบกลางดึก หรือหอบทั้งที่อยู่เฉยๆ ก็เป็นได้
    - เจ็บแน่นบริเวณหน้าอกเหมือนมีของกดทับ จนไม่สามารถนอนราบได้ บางรายอาจมีอาการปวดร้าวที่แขนซ้ายไปจนถึงไหล่ ซึ่งเป็นสัญญาณของภาวะกล้ามเนื้อหัวใจตายเฉียบพลัน
    - อาการใจสั่น หัวใจเต้นผิดจังหวะ
    - หน้ามืด เป็นลมหมดสติ หรือวูบไปโดยไม่มีสาเหตุบ่อยครั้ง
    - ขาหรือเท้าบวม เกิดจากการที่หัวใจด้านขวาทำงานลดลง ทำให้เลือดจากขาไม่สามารถไหลเวียนเข้าสู่หัวใจได้
    - ปลายมือ ปลายเท้า และริมฝีปากเขียวคล้ำ
    """)

    st.subheader("การรักษาโรค")
    st.markdown("""
    การรักษาโรคหัวใจนั้นมีหลายวิธีและควรรักษาร่วมไปกับการปรับเปลี่ยนพฤติกรรมในการใช้ชีวิตด้วย ในรายที่โรคหัวใจอาการหนักอาจจำเป็นต้องผ่าตัดหรือทำบอลลูน ส่วนในรายที่โรคหัวใจอาการไม่หนักมาก 
    สามารถให้ยารักษาเพื่อบรรเทาและควบคุมอาการ โดยยารักษาโรคหัวใจสามารถแบ่งได้เป็น 6 กลุ่ม ดังนี้    
    - **ยาต้านเกล็ดเลือด** ใช้ในผู้ป่วยภาวะโรคหลอดเลือดหัวใจตีบ รวมถึงผู้ที่ทำบอลลูน เพื่อยับยั้งการเกาะตัวของเกล็ดเลือดในบริเวณที่ขรุขระหรือมีรอยตีบ
    - **กลุ่มยาสำหรับผู้ป่วยความดันโลหิตสูง** เช่น ยาขับปัสสาวะ ยาขยายเส้นเลือดชนิดยาต้านแคลเซียม ยาขยายเส้นเลือดชนิดยาต้าน Angiotensin-Converting Enzyme (ACEI) และยาต้าน Angiotensin Receptor (ARB) 
    ที่ช่วยชะลอการเสื่อมของหลอดเลือด และป้องกันหลอดเลือดแข็งหรือตีบได้ ยาต้านเบต้า (Beta-Blocker) ที่ช่วยลดความดันโลหิตและอัตราการเต้นของหัวใจ บรรเทาอาการเจ็บหน้าอก
    - **ยากลุ่ม Nitrate** ช่วยขยายเส้นเลือดหัวใจ มีทั้งชนิดที่ใช้อมใต้ลิ้น แบบสเปรย์ และแบบรับประทาน โดยแบบที่เป็นยาอมใต้ลิ้นมักจะใช้ในกรณีที่มีอาการโรคหัวใจเฉียบพลัน หลังจากได้รับยาแล้วควรนั่งพัก 15-20 นาที 
    เพราะมีผลข้างเคียงทำให้ความดันโลหิตต่ำและเกิดอาการวูบได้
    - **ยาลดหรือควบคุมระดับไขมันในเลือด** เช่น Statin และยากลุ่ม Fibrate ที่ช่วยควบคุมระดับไขมันและคลอเลสเตอรอล ลดการอักเสบของหลอดเลือด ป้องกันการเกิดภาวะหลอดเลือดหัวใจอุดตันเฉียบพลัน
    - **ยารักษาโรคหัวใจควบคุมการเต้นหัวใจ** เช่น ยา Digitalis ยาต้านเบต้า (Beta-Blocker) ยา Amiodarone และยา Verapamil
    - **ยาต้านการแข็งตัวของเลือด** เช่น Warfarin ที่ช่วยป้องกันการแข็งตัวของเลือด แต่มีข้อเสียคือ ผู้ป่วยต้องมาพบแพทย์เพื่อปรับขนาดยาทุกๆ 1-3 เดือน ในขณะที่ยากลุ่ม NOAC (New Oral Anticoagulant Drugs) มีราคาสูงกว่า 
    แต่ไม่จำเป็นต้องปรับขนาดยามาก เช่น ยา Dabigatran, Rivaroxaban, Apixaban และ Edoxaban อย่างไรก็ตามยาทั้ง 2 ชนิดอาจทำให้เกิดภาวะเลือดออกได้ จึงต้องอยู่ภายใต้การดูแลของแพทย์อย่างใกล้ชิด
    """)


    